app/controllers/order_profiles_controller.rb

  def index
    @order_profiles = current_user.order_profiles.all
---
SELECT "order_profiles".* FROM "order_profiles" WHERE "order_profiles"."user_id" = $1  [["user_id", 1]]

  def new

    # @business_names = []
    # Business.find_each do |b|
    #   @business_names << [b.name, b.id]
    # end

    # @business_json=[]
    # Business.find_each do |b|
    #   @business_json << b.to_json
    # end

    # @product_names = []
    # Product.find_each do |p|
    #   @product_names << [p.name, [p.id, p.business_id]]
    # end

    # @product_json = []
    # Product.find_each do |j|
    #   @product_json << j.to_json
    # end

    @order_profile = current_user.order_profiles.build

    @businesses = Business.find_each.as_json
    @products = Product.find_each.as_json
---
SELECT  "businesses".* FROM "businesses"  ORDER BY "businesses"."id" ASC LIMIT 1000
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1000

  def edit
    @business_names = []
    Business.find_each do |b|
      @business_names << [b.name, b.id]
    end
    @product_names = []
    Product.find_each do |p|
---
SELECT  "businesses".* FROM "businesses"  ORDER BY "businesses"."id" ASC LIMIT 1000
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1000

  def create

    @order_profile = current_user.order_profiles.build(order_profile_params)


    respond_to do |format|
      if @order_profile.save
---
INSERT INTO "order_profiles" ("name", "product_id", "address_for_delivery", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["product_id", 1], ["address_for_delivery", ""], ["phone", ""], ["created_at", "2015-05-30 23:31:54.803540"], ["updated_at", "2015-05-30 23:31:54.803540"]]

  def destroy
    @order_profile.destroy
---
DELETE FROM "order_profiles" WHERE "order_profiles"."id" = $1  [["id", 1]]

    def set_order_profile
      @order_profile = current_user.order_profiles.find(params[:id])
---
SELECT  "order_profiles".* FROM "order_profiles" WHERE "order_profiles"."user_id" = $1 AND "order_profiles"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 9]]