app/controllers/orders_controller.rb

  def new
    @order = Order.new
    @order_profiles = OrderProfile.find_each.as_json
---
SELECT  "order_profiles".* FROM "order_profiles"  ORDER BY "order_profiles"."id" ASC LIMIT 1000

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-05-29 04:55:59.457654"], ["updated_at", "2015-05-29 04:55:59.457654"]]